// pages/communityRule/communityRule.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        lastUpdateTime: "2022年11月10日",
        introduction:"城院生态圈是一个温暖、友善、和谐的线上社区，为了维护社区的秩序，城院生态圈只允许讨论动植物主题类的内容，并且将会依据以下规范进行管理。在收到用户举报或者巡查发现违规行为时，会根据用户行为的影响程度对该用户采取禁言、封号等措施。本协议部分内容参考“朵朵校友圈社区规范”。",
        ruleList:[
            
            {
                "title": "违反法律法规",
                "content": [
                    "反对宪法所确定的基本原则",
                    "危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一",
                    "损害国家荣誉和利益",
                    "煽动民族仇恨，民族歧视，破坏民族团结",
                    "侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的",
                    "破坏国家宗教政策，宣扬邪教和封建迷信",
                    "散布谣言，扰乱社会秩序，破坏社会稳定",
                    "宣扬淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪",
                    "煽动非法集会、结社、游行、示威、聚众扰乱社会秩序",
                    "泄露他人隐私，侵害他人肖像权、姓名权或其他权益",
                    "捏造事实或身份，诽谤他人，产生恶劣影响",
                    "捏造、攻击、嘲讽、戏谑、传播历任及现任党和国家领导人相关敏感信息",
                    "出租、出售、求购、传播翻墙相关软件或信息",
                    "发布含有法律、行政法规禁止的其他内容的信息",
                    "发布上级监管部门禁止的危害平台安全的信息",
                ],
            },
            {
                "title": "违反信息发布要求 ",
                "content": [
                    "发布与动植物主题无关的信息，包括但不限于讨论学校、室友、上课等话题",
                    "发布虐待、人类行为捕杀动物、破坏植物等造成不良影响的内容",
                    "发布恶意诱导性信息",
                    "恶意发布错误的、有恶劣社会影响的百科信息",
                    "以同一或不同账号进行刷屏、重复跟帖等",
                    "宠物领养只允许无偿领养，禁止商家机构或个人进行宠物、植物的销售行为。",
                    "发布违反校规的信息",
                ],
            },
            {
                "title": "不友善的行为",
                "content": [
                    "轻蔑：贬低、轻视他人及其劳动成果",
                    "诽谤：捏造、散步虚假事实，损害他人名誉",
                    "嘲讽：以比喻、夸张、侮辱性的文字或图像，戏谑调侃他人，令人产生不适",
                    "挑衅：以不友好的方式激怒他人，意图使对方对自己的言论作出回应，蓄意制造事端。",
                    "引战：无根据地臆测他人的发言或行事动机，恶意进行引战",
                    "羞辱：贬低他人的能力、行为、生理或身份特征",
                    "谩骂：以不文明的语言攻击他人或实体",
                    "歧视：针对他人的民族、种族、宗教、性取向、性别、年龄、地域、生理特征、疾病、专业等身份或者归类的攻击",
                    "欺诈：通过编造身份或事实，谋取利益，引发混乱或哗众取宠",
                ],
            },
            {
                "title": "发布垃圾信息 ",
                "content": [
                    "以商家、机构、微商、代理、代购、中介、黄牛、个体户、兼职、自由职业者等任何商业省份发布牟利或推广信息",
                    "有组织的发布以软文发布售卖产品、提供服务、宣传推广等内容的垃圾广告",
                    "通过快速发帖、回帖、发布无意义图文等行为干扰社区秩序和用户体验",
                    "频繁回复过早时期的帖文，对他人造成干扰",
                    "频繁私聊骚扰他人，干扰社区秩序",
                    "发布、转载或讨论极端动保主义、极端环保主义、极端女权主义、极端素食主义、饭圈等相关经典引战话题",
                ],
            },
        ]
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})